<?php

define( 'DVWA_WEB_PAGE_TO_ROOT', '' );
require_once DVWA_WEB_PAGE_TO_ROOT . 'dvwa/includes/dvwaPage.inc.php';

dvwaPageStartup( array( 'authenticated' ) );

$page = dvwaPageNewGrab();
$page[ 'title' ]   = '欢迎来到神盾靶场！';
$page[ 'page_id' ] = 'home';

$page[ 'body' ] .= "
<div class=\"body_padded\">
	<h1><svg fill='#2a2a2a' xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 512 512\"><path d=\"M256 0c4.6 0 9.2 1 13.4 2.9L457.7 82.8c22 9.3 38.4 31 38.3 57.2c-.5 99.2-41.3 280.7-213.6 363.2c-16.7 8-36.1 8-52.8 0C57.3 420.7 16.5 239.2 16 140c-.1-26.2 16.3-47.9 38.3-57.2L242.7 2.9C246.8 1 251.4 0 256 0zm0 66.8l0 378.1C394 378 431.1 230.1 432 141.4L256 66.8s0 0 0 0z\"/></svg>
	欢迎来到神盾靶场
    </h1>
		<p>欢迎使用本靶场，它专为提升您的网络安全技能而设计。我们提供多种网络安全漏洞，每种漏洞都有低、中、高三个难度等级的攻击页面，帮助您逐步掌握不同的攻击策略和防御技巧。通过实时的攻防模拟演练，您将获得一个全面的实战训练平台，无论是初学者还是安全专家，都能在这里提升自己的实战能力。</p>
	<p>智防盾牌靶场的目标是通过简单明了的界面来练习一些最常见的 Web 漏洞，具有不同的难度级别。</p>
	<hr />
	<br />

	<h2><svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 512 512\"><path  fill='#4a4a4a' d=\"M91.7 96C106.3 86.8 116 70.5 116 52C116 23.3 92.7 0 64 0S12 23.3 12 52c0 16.7 7.8 31.5 20 41l0 3 0 352 0 64 64 0 0-64 373.6 0c14.6 0 26.4-11.8 26.4-26.4c0-3.7-.8-7.3-2.3-10.7L432 272l61.7-138.9c1.5-3.4 2.3-7 2.3-10.7c0-14.6-11.8-26.4-26.4-26.4L91.7 96z\"/></svg>
	一般说明</h2>
	<p>这取决于用户如何处理神盾靶场。要么在固定级别完成每个模块，要么选择任何模块并在进入下一个模块之前努力达到他们可以达到的最高级别。没有一个固定的对象来完成一个模块;但是，用户应该认为他们已经通过使用该特定漏洞尽可能成功地利用了系统。</p>
	<p>请注意，此软件<em>存在记录在案和未记录的漏洞</em>。这是有意为之的。我们鼓励您尝试发现尽可能多的问题。</p>
	<p>每个页面的底部都有一个帮助按钮，允许您查看该漏洞的提示和提示。此外，还有一些额外的链接，用于进一步的背景阅读，这与该安全问题有关。</p>
	<hr />
	<br />

	<h2><svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 512 512\"><path fill='#4a4a4a' d=\"M64 32C28.7 32 0 60.7 0 96L0 416c0 35.3 28.7 64 64 64l384 0c35.3 0 64-28.7 64-64l0-320c0-35.3-28.7-64-64-64L64 32zM175 175c9.4-9.4 24.6-9.4 33.9 0l47 47 47-47c9.4-9.4 24.6-9.4 33.9 0s9.4 24.6 0 33.9l-47 47 47 47c9.4 9.4 9.4 24.6 0 33.9s-24.6 9.4-33.9 0l-47-47-47 47c-9.4 9.4-24.6 9.4-33.9 0s-9.4-24.6 0-33.9l47-47-47-47c-9.4-9.4-9.4-24.6 0-33.9z\"/></svg>
    警告
	</h2>
	<p>这个靶场非常脆弱！<em>请勿将其上传到您的托管提供商的公共 HTML 文件夹或任何面向互联网的服务器</em>，否则将会被攻陷。建议使用虚拟机（如 " . dvwaExternalLinkUrlGet( 'https://www.virtualbox.org/','VirtualBox' ) . " 或 " . dvwaExternalLinkUrlGet( 'https://www.vmware.com/','VMware' ) . "），设置为 NAT 网络模式。在访客机器内，您可以下载并安装 " . dvwaExternalLinkUrlGet( 'https://www.apachefriends.org/','XAMPP' ) . " 用于 web 服务器和数据库。</p>
	<br />
	<h2><svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 448 512\"><path fill='#4a4a4a' d=\"M224 16c-6.7 0-10.8-2.8-15.5-6.1C201.9 5.4 194 0 176 0c-30.5 0-52 43.7-66 89.4C62.7 98.1 32 112.2 32 128c0 14.3 25 27.1 64.6 35.9c-.4 4-.6 8-.6 12.1c0 17 3.3 33.2 9.3 48l-59.9 0C38 224 32 230 32 237.4c0 1.7 .3 3.4 1 5l38.8 96.9C28.2 371.8 0 423.8 0 482.3C0 498.7 13.3 512 29.7 512l388.6 0c16.4 0 29.7-13.3 29.7-29.7c0-58.5-28.2-110.4-71.7-143L415 242.4c.6-1.6 1-3.3 1-5c0-7.4-6-13.4-13.4-13.4l-59.9 0c6-14.8 9.3-31 9.3-48c0-4.1-.2-8.1-.6-12.1C391 155.1 416 142.3 416 128c0-15.8-30.7-29.9-78-38.6C324 43.7 302.5 0 272 0c-18 0-25.9 5.4-32.5 9.9c-4.8 3.3-8.8 6.1-15.5 6.1zm56 208l-12.4 0c-16.5 0-31.1-10.6-36.3-26.2c-2.3-7-12.2-7-14.5 0c-5.2 15.6-19.9 26.2-36.3 26.2L168 224c-22.1 0-40-17.9-40-40l0-14.4c28.2 4.1 61 6.4 96 6.4s67.8-2.3 96-6.4l0 14.4c0 22.1-17.9 40-40 40zm-88 96l16 32L176 480 128 288l64 32zm128-32L272 480 240 352l16-32 64-32z\"/></svg>
	免责声明
	</h2>
	<p>我们不对任何人使用此应用程序（神盾靶场）的方式承担责任。我们已明确说明该应用程序的目的，不应恶意使用。我们已发出警告，并采取措施防止用户在实时 web 服务器上安装神盾靶场。如果您的 web 服务器因安装神盾靶场而被攻陷，责任不在我们，而在于上传和安装它的人员。</p>
	<hr />
	<br />

	<h2>
	<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 448 512\"><path fill='#4a4a4a' d=\"M80 104a24 24 0 1 0 0-48 24 24 0 1 0 0 48zm80-24c0 32.8-19.7 61-48 73.3l0 87.8c18.8-10.9 40.7-17.1 64-17.1l96 0c35.3 0 64-28.7 64-64l0-6.7C307.7 141 288 112.8 288 80c0-44.2 35.8-80 80-80s80 35.8 80 80c0 32.8-19.7 61-48 73.3l0 6.7c0 70.7-57.3 128-128 128l-96 0c-35.3 0-64 28.7-64 64l0 6.7c28.3 12.3 48 40.5 48 73.3c0 44.2-35.8 80-80 80s-80-35.8-80-80c0-32.8 19.7-61 48-73.3l0-6.7 0-198.7C19.7 141 0 112.8 0 80C0 35.8 35.8 0 80 0s80 35.8 80 80zm232 0a24 24 0 1 0 -48 0 24 24 0 1 0 48 0zM80 456a24 24 0 1 0 0-48 24 24 0 1 0 0 48z\"/></svg>
	更多培训资源
		</h2>
	<p>神盾靶场旨在涵盖当今 web 应用程序中最常见的漏洞。然而，web 应用程序还有许多其他问题。如果您希望探索其他攻击向量，或想要更具挑战性的难度，可以考虑以下其他项目：</p>
	<hr />
	<br />
</div>";

dvwaHtmlEcho( $page );

?>
